# Домашнее задание
# Задача №6/1(решить через for)
# Выведи на экран все числа в диапазоне от 54 до 9184 кратные 5
print('Hello Overone!')