# Домашнее задание Задача №12/5
# Даны два кортежа:
# C_1 = (35, 78,21,37, 2,98, 6, 100, 231)
# C_2 = (45, 21,124,76,5,23,91,234)
# Необходимо определить:
# 1) Сумма элементов какого из кортежей больше и вывести соответствующее сообщение на экран (Сумма больше в кортеже - ..)
# 2) Вывести на экран порядковые номера минимальных и максимальных элементов этих кортежей
C_1 = (35, 78,21,37, 2,98, 6, 100, 231)
C_2 = (45, 21,124,76,5,23,91,234)
print(f'Исходные кортежи:\nC_1 {C_1}\nC_2 {C_2}')
if sum(C_1) > sum(C_2):
    print(f'Сумма елементов больше в кортеже - C_1 ({sum(C_1)})')
else: print(f'Сумма больше в кортеже - C_2 ({sum(C_2)})')
print(f'В кортеже:\nC_1 элемент с min значением {min(C_1)} находится под порядковым № {C_1.index(min(C_1))+1}')
print(f'C_1 элемент с max значением {max(C_1)} находится под порядковым № {C_1.index(max(C_1))+1}')
print(f'C_2 элемент с min значением {min(C_2)} находится под порядковым № {C_2.index(min(C_2))+1}')
print(f'C_2 элемент с max значением {max(C_2)} находится под порядковым № {C_2.index(max(C_2))+1}')