# Домашнее задание
# Задача №5 (Number squares)
# Написать программу, которая вычисляет квадраты чисел от 1 до 10
# (использовать цикл while)
a = 0
while a < 10:
    a +=1
    print('Квадрат ',a, ' равен ',a**2)

# Квадрат  1  равен  1
# Квадрат  2  равен  4
# Квадрат  3  равен  9
# Квадрат  4  равен  16
# Квадрат  5  равен  25
# Квадрат  6  равен  36
# Квадрат  7  равен  49
# Квадрат  8  равен  64
# Квадрат  9  равен  81
# Квадрат  10  равен  100